Revit 2027 API
CurveByPointsArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CurveByPointsArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As CurveByPointsArrayIterator
public:
virtual CurveByPointsArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> CurveByPointsArrayIterator
override ForwardIterator : unit -> CurveByPointsArrayIterator
Return Value
CurveByPointsArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
CurveByPointsArray Class
Autodesk.Revit.DB Namespace